In [1]:
import warnings
warnings.filterwarnings('ignore')

# csv

In [2]:
import numpy as np
import pandas as pd

In [32]:
ar1 = np.arange(10).reshape(2, 5)
df = pd.DataFrame(ar1, columns=list('abcde'))#, index=['R1', 'R2'])
df

   a  b  c  d  e
0  0  1  2  3  4
1  5  6  7  8  9

In [33]:
df.to_csv('dataset/test.csv') # index = None 해줘야 unnamed 안뜸
df

   a  b  c  d  e
0  0  1  2  3  4
1  5  6  7  8  9

In [34]:
df_o = pd.read_csv('dataset/test.csv', index_col=0) #안해줬으면 index_col 옵션사용
df_o

   a  b  c  d  e
0  0  1  2  3  4
1  5  6  7  8  9

# json

In [35]:
df1 = df.copy()
df1.to_json('dataset/test.json')

```
dictionary 형태로 되ㅇ있ㄷ[ㅔ
{"a":{"0":0,"1":5},"b":{"0":1,"1":6},"c":{"0":2,"1":7},"d":{"0":3,"1":8},"e":{"0":4,"1":9}}
```

In [36]:
df1_json = pd.read_json('dataset/test.json')
df1_json

   a  b  c  d  e
0  0  1  2  3  4
1  5  6  7  8  9

# 바이너리 파일 읽고 쓰기

In [37]:
df2 = df.copy()
df2

   a  b  c  d  e
0  0  1  2  3  4
1  5  6  7  8  9

In [38]:
df2.to_pickle('dataset/test.pkl')

```
뺎
```

In [10]:
df2_pkl = pd.read_pickle('dataset/test.pkl')
df2_pkl

   a  b  c  d  e
0  0  1  2  3  4
1  5  6  7  8  9

# 엑셀 파일

openpyxl 설치해야해

## openpyxl

In [39]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\admin\anaconda3\envs\cakd7\lib\site-packages (3.0.10)
Requirement already satisfied: et-xmlfile in c:\users\admin\anaconda3\envs\cakd7\lib\site-packages (from openpyxl) (1.1.0)

# 자동차 파일~

In [52]:
df = pd.read_excel('dataset/auto-mpg.xlsx')
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

# 연습 해보세여

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car name      398 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [54]:
df.index

RangeIndex(start=0, stop=398, step=1)

In [55]:
print(df.columns, type(df.columns))

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model year', 'origin', 'car name'],
      dtype='object') <class 'pandas.core.indexes.base.Index'>

In [56]:
df.set_index('car name', inplace=True)

In [57]:
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin
car name,,,,,,,,
chevrolet chevelle malibu,18.0,8,307.0,130,3504,12.0,70,1
buick skylark 320,15.0,8,350.0,165,3693,11.5,70,1
plymouth satellite,18.0,8,318.0,150,3436,11.0,70,1
amc rebel sst,16.0,8,304.0,150,3433,12.0,70,1
ford torino,17.0,8,302.0,140,3449,10.5,70,1
...,...,...,...,...,...,...,...,...
ford mustang gl,27.0,4,140.0,86,2790,15.6,82,1
vw pickup,44.0,4,97.0,52,2130,24.6,82,2
dodge rampage,32.0,4,135.0,84,2295,11.6,82,1
ford ranger,28.0,4,120.0,79,2625,18.6,82,1
chevy s-10,31.0,4,119.0,82,2720,19.4,82,1

In [58]:
df.index

Index(['chevrolet chevelle malibu', 'buick skylark 320', 'plymouth satellite',
       'amc rebel sst', 'ford torino', 'ford galaxie 500', 'chevrolet impala',
       'plymouth fury iii', 'pontiac catalina', 'amc ambassador dpl',
       ...
       'chrysler lebaron medallion', 'ford granada l', 'toyota celica gt',
       'dodge charger 2.2', 'chevrolet camaro', 'ford mustang gl', 'vw pickup',
       'dodge rampage', 'ford ranger', 'chevy s-10'],
      dtype='object', name='car name', length=398)

In [59]:
df.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model year', 'origin'],
      dtype='object')

In [60]:
col0 = df.columns[3:4].to_list() # index object을 list로 변경
col1=df.columns[:3].to_list()
col2=df.columns[4:].to_list()
new_col=col0 + col1+col2
df=df[new_col]

In [61]:
df.head()

,horsepower,mpg,cylinders,displacement,weight,acceleration,model year,origin
car name,,,,,,,,
chevrolet chevelle malibu,130,18.0,8,307.0,3504,12.0,70,1
buick skylark 320,165,15.0,8,350.0,3693,11.5,70,1
plymouth satellite,150,18.0,8,318.0,3436,11.0,70,1
amc rebel sst,150,16.0,8,304.0,3433,12.0,70,1
ford torino,140,17.0,8,302.0,3449,10.5,70,1

In [62]:
df.sort_index()

,horsepower,mpg,cylinders,displacement,weight,acceleration,model year,origin
car name,,,,,,,,
amc ambassador brougham,175,13.0,8,360.0,3821,11.0,73,1
amc ambassador dpl,190,15.0,8,390.0,3850,8.5,70,1
amc ambassador sst,150,17.0,8,304.0,3672,11.5,72,1
amc concord,90,24.3,4,151.0,3003,20.1,80,1
amc concord,90,19.4,6,232.0,3210,17.2,78,1
...,...,...,...,...,...,...,...,...
vw pickup,52,44.0,4,97.0,2130,24.6,82,2
vw rabbit,76,41.5,4,98.0,2144,14.7,80,2
vw rabbit,70,29.0,4,90.0,1937,14.2,76,2
vw rabbit c (diesel),48,44.3,4,90.0,2085,21.7,80,2
vw rabbit custom,71,31.9,4,89.0,1925,14.0,79,2

df.sort_values(by = ['horsepower']) # 이셋기 object이라 sort안되나봄

df.astype({'horsepower':'float'}) #str -> int OR float 안됨;;

In [64]:
df.isnull().sum().sum()

0

In [65]:
df.horsepower.unique() # 저 물음표 때문에..?

array([130, 165, 150, 140, 198, 220, 215, 225, 190, 170, 160, 95, 97, 85,
       88, 46, 87, 90, 113, 200, 210, 193, '?', 100, 105, 175, 153, 180,
       110, 72, 86, 70, 76, 65, 69, 60, 80, 54, 208, 155, 112, 92, 145,
       137, 158, 167, 94, 107, 230, 49, 75, 91, 122, 67, 83, 78, 52, 61,
       93, 148, 129, 96, 71, 98, 115, 53, 81, 79, 120, 152, 102, 108, 68,
       58, 149, 89, 63, 48, 66, 139, 103, 125, 133, 138, 135, 142, 77, 62,
       132, 84, 64, 74, 116, 82], dtype=object)

In [66]:
df[df.horsepower == '?']

,horsepower,mpg,cylinders,displacement,weight,acceleration,model year,origin
car name,,,,,,,,
ford pinto,?,25.0,4,98.0,2046,19.0,71,1
ford maverick,?,21.0,6,200.0,2875,17.0,74,1
renault lecar deluxe,?,40.9,4,85.0,1835,17.3,80,2
ford mustang cobra,?,23.6,4,140.0,2905,14.3,80,1
renault 18i,?,34.5,4,100.0,2320,15.8,81,2
amc concord dl,?,23.0,4,151.0,3035,20.5,82,1